_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УтверждениеКалендарногоПланаГрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_УтверждениеКалендарногоПланаГрафика</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВерсииПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_СтатусыУтвержденияКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актуальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КопияСценария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаОбъема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоРаботыПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеРаботыПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаДлительности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммарнаяРабота</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_ПараметрыВыполненияРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_ПараметрыВыполненияРабот</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъемРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаОбъема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРаботыПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеРаботыПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыПланированияСтроительныхРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Утверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_ПотребностьВМатериалах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_ПотребностьВМатериалах</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНаЕдиницуОбъема</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУпаковокНаЕдиницуОбъема</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНаОбъемРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУпаковокНаОбъемРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыПланированияСтроительныхРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_ПотребностьВРесурсах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_ПотребностьВРесурсах</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗагрузкаПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Трудоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Машиноемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыПланированияСтроительныхРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыПланированияСтроительныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыПланированияСтроительныхРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Календарный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месячный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедельноСуточный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыСценариевПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыСценариевПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Базовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийРабочий</Name>
					<Comment>Внешний рабочий (для договора с заказчиком)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УтверждениеКалендарногоПланаГрафика/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаправлениеДеятельности) Тогда
		НаправлениеДеятельности = ОбъектСтроительства.ОбъектСтроительства.НаправлениеДеятельности;
	КонецЕсли;
		
	Если СценарийПланирования.НовыйВариант И Работы.Количество() Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя изменять документы для сценария, переведенного на новый вариант",,,,Отказ);
		
	КонецЕсли; 		
	
	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если Актуальный И (РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ РежимЗаписи = РежимЗаписиДокумента.Запись И Проведен) Тогда
		ПроверитьНаСуществующиеДокументы(Отказ);
	КонецЕсли;
	
	УдалитьДанныеИзРегистра(); 
	
КонецПроцедуры

Процедура  ПроверитьНаСуществующиеДокументы(Отказ)
	
	Если СценарийПланирования.НовыйВариант Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СценарийПланирования",СценарийПланирования);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УСОERP_УтверждениеКалендарногоПланаГрафика.Ссылка
	|ИЗ
	|	Документ.УСОERP_УтверждениеКалендарногоПланаГрафика КАК УСОERP_УтверждениеКалендарногоПланаГрафика
	|ГДЕ
	|	УСОERP_УтверждениеКалендарногоПланаГрафика.Проведен
	|	И УСОERP_УтверждениеКалендарногоПланаГрафика.СценарийПланирования = &СценарийПланирования
	|	И УСОERP_УтверждениеКалендарногоПланаГрафика.Ссылка <> &Ссылка
	|	И УСОERP_УтверждениеКалендарногоПланаГрафика.Актуальный";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий()  Тогда
		
		Отказ = Истина;
		Сообщить("Уже есть актуальные документы ""Внутренний план производства работ"" по сценарию " + СценарийПланирования + ". Необходимо отменить их актуальность.");	
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура УдалитьДанныеИзРегистра()
	
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ",Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УСОERP_ПараметрыВыполненияРабот.Период,
	|	УСОERP_ПараметрыВыполненияРабот.Работа,
	|	УСОERP_ПараметрыВыполненияРабот.ВидПланирования,
	|	УСОERP_ПараметрыВыполненияРабот.Утверждена,
	|	УСОERP_ПараметрыВыполненияРабот.ОбъемРаботы,
	|	УСОERP_ПараметрыВыполненияРабот.ЕдиницаОбъема,
	|	УСОERP_ПараметрыВыполненияРабот.НачалоРаботыПлан,
	|	УСОERP_ПараметрыВыполненияРабот.ОкончаниеРаботыПлан,
	|	УСОERP_ПараметрыВыполненияРабот.ДлительностьПлан,
	|	УСОERP_ПараметрыВыполненияРабот.ЕдиницаДлительности,
	|	УСОERP_ПараметрыВыполненияРабот.АвторИзменения,
	|	УСОERP_ПараметрыВыполненияРабот.Документ
	|ИЗ
	|	РегистрСведений.УСОERP_ПараметрыВыполненияРабот КАК УСОERP_ПараметрыВыполненияРабот
	|ГДЕ
	|	УСОERP_ПараметрыВыполненияРабот.Документ = &Документ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МЗ = РегистрыСведений.УСОERP_ПараметрыВыполненияРабот.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ,Выборка);
		МЗ.Прочитать();	
		МЗ.Удалить();
		
	КонецЦикла;
	
	Если СценарийПланирования.НовыйВариант Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УСОERP_ПотребностьВМатериалах.Период,
		|	УСОERP_ПотребностьВМатериалах.Работа,
		|	УСОERP_ПотребностьВМатериалах.Номенклатура,
		|	УСОERP_ПотребностьВМатериалах.Характеристика,
		|	УСОERP_ПотребностьВМатериалах.ВидПланирования,
		|	УСОERP_ПотребностьВМатериалах.СценарийПланирования,
		|	УСОERP_ПотребностьВМатериалах.Упаковка,
		|	УСОERP_ПотребностьВМатериалах.КоличествоНаЕдиницуОбъема,
		|	УСОERP_ПотребностьВМатериалах.КоличествоУпаковокНаЕдиницуОбъема,
		|	УСОERP_ПотребностьВМатериалах.КоличествоНаОбъемРаботы,
		|	УСОERP_ПотребностьВМатериалах.КоличествоУпаковокНаОбъемРаботы,
		|	УСОERP_ПотребностьВМатериалах.АвторИзмерения,
		|	УСОERP_ПотребностьВМатериалах.Документ
		|ИЗ
		|	РегистрСведений.УСОERP_ПотребностьВМатериалах КАК УСОERP_ПотребностьВМатериалах
		|ГДЕ
		|	УСОERP_ПотребностьВМатериалах.Документ = &Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УСОERP_ПотребностьВРесурсах.Период,
		|	УСОERP_ПотребностьВРесурсах.Работа,
		|	УСОERP_ПотребностьВРесурсах.Ресурс,
		|	УСОERP_ПотребностьВРесурсах.ВидПланирования,
		|	УСОERP_ПотребностьВРесурсах.СценарийПланирования,
		|	УСОERP_ПотребностьВРесурсах.Количество,
		|	УСОERP_ПотребностьВРесурсах.ЗагрузкаПроцент,
		|	УСОERP_ПотребностьВРесурсах.ГрафикРаботы,
		|	УСОERP_ПотребностьВРесурсах.Трудоемкость,
		|	УСОERP_ПотребностьВРесурсах.Машиноемкость,
		|	УСОERP_ПотребностьВРесурсах.АвторИзмерения,
		|	УСОERP_ПотребностьВРесурсах.Документ
		|ИЗ
		|	РегистрСведений.УСОERP_ПотребностьВРесурсах КАК УСОERP_ПотребностьВРесурсах
		|ГДЕ
		|	УСОERP_ПотребностьВРесурсах.Документ = &Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УСОERP_СвязиМеждуРаботами.Период,
		|	УСОERP_СвязиМеждуРаботами.ОбъектСтроительстваПредшественника,
		|	УСОERP_СвязиМеждуРаботами.РаботаПредшественник,
		|	УСОERP_СвязиМеждуРаботами.РаботаПоследователь,
		|	УСОERP_СвязиМеждуРаботами.СценарийПланирования,
		|	УСОERP_СвязиМеждуРаботами.ТипЗависимости,
		|	УСОERP_СвязиМеждуРаботами.Задержка,
		|	УСОERP_СвязиМеждуРаботами.ЕдиницаЗадержки,
		|	УСОERP_СвязиМеждуРаботами.АвторИзмерения,
		|	УСОERP_СвязиМеждуРаботами.Документ
		|ИЗ
		|	РегистрСведений.УСОERP_СвязиМеждуРаботами КАК УСОERP_СвязиМеждуРаботами
		|ГДЕ
		|	УСОERP_СвязиМеждуРаботами.Документ = &Документ";
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		Выборка = РезультатЗапроса[0].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			МЗ = РегистрыСведений.УСОERP_ПотребностьВМатериалах.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ,Выборка);
			МЗ.Прочитать();	
			МЗ.Удалить();
			
		КонецЦикла;
		
		Выборка = РезультатЗапроса[1].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			МЗ = РегистрыСведений.УСОERP_ПотребностьВРесурсах.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ,Выборка);
			МЗ.Прочитать();	
			МЗ.Удалить();
			
		КонецЦикла;
		
		Выборка = РезультатЗапроса[2].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			МЗ = РегистрыСведений.УСОERP_СвязиМеждуРаботами.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ,Выборка);
			МЗ.Прочитать();	
			
			МЗ.Удалить();
			
		КонецЦикла;  	
		
	КонецЕсли; 	
	
КонецПроцедуры

Процедура УдалитьУтвержденныеРаботы() 	
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Сценарий",СценарийПланирования);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УСОERP_ПараметрыВыполненияРабот.Период,
	|	УСОERP_ПараметрыВыполненияРабот.Работа,
	|	УСОERP_ПараметрыВыполненияРабот.ВидПланирования,
	|	УСОERP_ПараметрыВыполненияРабот.Утверждена,
	|	УСОERP_ПараметрыВыполненияРабот.ОбъемРаботы,
	|	УСОERP_ПараметрыВыполненияРабот.ЕдиницаОбъема,
	|	УСОERP_ПараметрыВыполненияРабот.НачалоРаботыПлан,
	|	УСОERP_ПараметрыВыполненияРабот.ОкончаниеРаботыПлан,
	|	УСОERP_ПараметрыВыполненияРабот.ДлительностьПлан,
	|	УСОERP_ПараметрыВыполненияРабот.ЕдиницаДлительности,
	|	УСОERP_ПараметрыВыполненияРабот.АвторИзменения,
	|	УСОERP_ПараметрыВыполненияРабот.Документ
	|ИЗ
	|	РегистрСведений.УСОERP_ПараметрыВыполненияРабот КАК УСОERP_ПараметрыВыполненияРабот
	|ГДЕ
	|	УСОERP_ПараметрыВыполненияРабот.Утверждена
	|	И УСОERP_ПараметрыВыполненияРабот.Работа.Владелец = &Сценарий
	|	И УСОERP_ПараметрыВыполненияРабот.Документ = ЗНАЧЕНИЕ(Документ.УСОERP_УтверждениеКалендарногоПланаГрафика.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МЗ = РегистрыСведений.УСОERP_ПараметрыВыполненияРабот.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ,Выборка);
		МЗ.Прочитать();	
		МЗ.Удалить();
		
	КонецЦикла; 	
	
КонецПроцедуры  

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(КопияСценария) Тогда
		
		Если СценарийПланирования.НовыйВариант = Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не создана копия сценария!",,,,Отказ);
		КонецЕсли;
			
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	УдалитьУтвержденныеРаботы();

	//ОтменитьПризнакУтверждения();
	
	//// все не суммарные работы
	//НеСуммарныеРаботы = Новый СписокЗначений;
	//Для каждого ТекСтрока Из Работы Цикл
	//	ЭтоСуммарнаяРабота = УСОERP_УправлениеСтроительнымПроизводством.ЭтоСуммарнаяРабота(ТекСтрока.Работа);
	//	Если Не ЭтоСуммарнаяРабота Тогда
	//		НеСуммарныеРаботы.Добавить(ТекСтрока.Работа);
	//	КонецЕсли;
	//КонецЦикла; 
	
	Документы.УСОERP_УтверждениеКалендарногоПланаГрафика.ИнициализироватьДанныеДокумента(Ссылка,  ДополнительныеСвойства);  	
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	СформироватьСписокРегистровДляКонтроля(); 
	
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);    
	
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	ДанныеДляПроведения = ДанныеДляПроведения();
	
	СформироватьДвижения(ДанныеДляПроведения);
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	СформироватьСписокРегистровДляКонтроля();
	
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	//ТаблицаДанных = Работы.Выгрузить();
	//ТаблицаДанных.Колонки.Работа.Имя = "СтроительнаяРабота";
	//СформироватьДвижения(ТаблицаДанных,Ложь)
	
	//РегистрыСведений.УСОERP_ПараметрыВыполненияРабот.ОтменитьПризнакУтверждения(Ссылка, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПроведения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаСреза", Новый Граница(КонецДня(Ссылка.ДатаВерсииПлана), ВидГраницы.Включая));   	
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаРабот.Работа КАК СтроительнаяРабота,
	|	ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыПланированияСтроительныхРабот.Календарный) КАК ВидПланирования,
	|	ТаблицаРабот.ОбъемРаботы,
	|	ТаблицаРабот.ЕдиницаОбъема,
	|	ТаблицаРабот.НачалоРаботыПлан,
	|	ТаблицаРабот.ОкончаниеРаботыПлан,
	|	ТаблицаРабот.ДлительностьПлан,
	|	ТаблицаРабот.ЕдиницаДлительности,
	|	ТаблицаРабот.Ссылка.Ответственный КАК АвторИзменения
	|ИЗ
	|	Документ.УСОERP_УтверждениеКалендарногоПланаГрафика.Работы КАК ТаблицаРабот
	|ГДЕ
	|	ТаблицаРабот.Ссылка = &Ссылка
	|	И ТаблицаРабот.Ссылка.СценарийПланирования.ВидСценария = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыСценариевПланирования.Рабочий)";				   
	ДанныеДляПроведения = Запрос.Выполнить().Выгрузить();
	
	Возврат ДанныеДляПроведения;
	
КонецФункции

Процедура СформироватьДвижения(ТаблицаДанных, Записывать = Истина)
	
	Если НЕ Актуальный Тогда
		Возврат;
	КонецЕсли;	
	
	Для каждого СтрокаРаботы из ТаблицаДанных Цикл
		
		ТекРабота = ?(ЗначениеЗаполнено(СтрокаРаботы.СтроительнаяРабота.РаботаИсточник),СтрокаРаботы.СтроительнаяРабота.РаботаИсточник,СтрокаРаботы.СтроительнаяРабота);
				
		НаборЗаписейПараметрыВР = РегистрыСведений.УСОERP_ПараметрыВыполненияРабот.СоздатьНаборЗаписей();
		НаборЗаписейПараметрыВР.Отбор.Работа.Установить(ТекРабота);
		НаборЗаписейПараметрыВР.Отбор.Утверждена.Установить(Истина);		
		НаборЗаписейПараметрыВР.Прочитать();
		НаборЗаписейПараметрыВР.Очистить();
		
		Если Записывать Тогда
			
			НовыйКурс = НаборЗаписейПараметрыВР.Добавить();
			НовыйКурс.Работа = ТекРабота;
			ЗаполнитьЗначенияСвойств(НовыйКурс,СтрокаРаботы);
			НовыйКурс.Период = Ссылка.Дата;
			НовыйКурс.Утверждена = Истина;
			НовыйКурс.Документ = Ссылка;
			
		КонецЕсли;
		
		НаборЗаписейПараметрыВР.Записать();
		
	КонецЦикла;
	
	Если СценарийПланирования.НовыйВариант Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СценарийПланирования",СценарийПланирования);
		Запрос.УстановитьПараметр("КопияСценария",КопияСценария);
		Запрос.УстановитьПараметр("Период",Дата);
		Запрос.УстановитьПараметр("Ответственный",Ответственный);
		Запрос.УстановитьПараметр("Документ",Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	&Период,
		|	УСОERP_СтроительныеРаботыМатериалы.Ссылка.РаботаИсточник КАК Работа,
		|	УСОERP_СтроительныеРаботыМатериалы.Номенклатура,
		|	УСОERP_СтроительныеРаботыМатериалы.Характеристика,
		|	ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыПланированияСтроительныхРабот.Календарный) КАК ВидПланирования,
		|	&СценарийПланирования,
		|	УСОERP_СтроительныеРаботыМатериалы.Упаковка,
		|	УСОERP_СтроительныеРаботыМатериалы.КоличествоНаЕдиницуОбъема,
		|	УСОERP_СтроительныеРаботыМатериалы.КоличествоУпаковокНаЕдиницуОбъема,
		|	УСОERP_СтроительныеРаботыМатериалы.КоличествоНаОбъемРаботы,
		|	УСОERP_СтроительныеРаботыМатериалы.КоличествоУпаковокНаОбъемРаботы,
		|	&Ответственный КАК АвторИзмерения,
		|	&Документ
		|ИЗ
		|	Справочник.УСОERP_СтроительныеРаботы.Материалы КАК УСОERP_СтроительныеРаботыМатериалы
		|ГДЕ
		|	УСОERP_СтроительныеРаботыМатериалы.Ссылка.Владелец = &КопияСценария
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период,
		|	УСОERP_СтроительныеРаботыРесурсы.Ссылка.РаботаИсточник КАК Работа,
		|	УСОERP_СтроительныеРаботыРесурсы.Ресурс,
		|	ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыПланированияСтроительныхРабот.Календарный) КАК ВидПланирования,
		|	&СценарийПланирования,
		|	УСОERP_СтроительныеРаботыРесурсы.Количество,
		|	УСОERP_СтроительныеРаботыРесурсы.ЗагрузкаПроцент,
		|	УСОERP_СтроительныеРаботыРесурсы.Трудоемкость,
		|	УСОERP_СтроительныеРаботыРесурсы.Машиноемкость,
		|	&Ответственный КАК АвторИзмерения,
		|	&Документ
		|ИЗ
		|	Справочник.УСОERP_СтроительныеРаботы.Ресурсы КАК УСОERP_СтроительныеРаботыРесурсы
		|ГДЕ
		|	УСОERP_СтроительныеРаботыРесурсы.Ссылка.Владелец = &КопияСценария
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период,
		|	УСОERP_СтроительныеРаботыПредшественники.СтроительнаяРабота.РаботаИсточник.Владелец.Владелец КАК ОбъектСтроительстваПредшественника,
		|	УСОERP_СтроительныеРаботыПредшественники.СтроительнаяРабота.РаботаИсточник КАК РаботаПредшественник,
		|	УСОERP_СтроительныеРаботыПредшественники.Ссылка.РаботаИсточник КАК РаботаПоследователь,
		|	&СценарийПланирования,
		|	УСОERP_СтроительныеРаботыПредшественники.ТипЗависимости,
		|	УСОERP_СтроительныеРаботыПредшественники.Задержка,
		|	УСОERP_СтроительныеРаботыПредшественники.ЕдиницаЗадержки,
		|	&Ответственный КАК АвторИзмерения,
		|	&Документ
		|ИЗ
		|	Справочник.УСОERP_СтроительныеРаботы.Предшественники КАК УСОERP_СтроительныеРаботыПредшественники
		|ГДЕ
		|	УСОERP_СтроительныеРаботыПредшественники.Ссылка.Владелец = &КопияСценария
		|	И УСОERP_СтроительныеРаботыПредшественники.Ссылка.ЕстьПредшественники
		|	И НЕ УСОERP_СтроительныеРаботыПредшественники.Ссылка.СуммарнаяРабота";
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		НЗ = РегистрыСведений.УСОERP_ПотребностьВМатериалах.СоздатьНаборЗаписей();
		НЗ.Отбор.СценарийПланирования.Установить(СценарийПланирования);
		НЗ.Прочитать();				
		НЗ.Загрузить(РезультатЗапроса[0].Выгрузить());
		НЗ.Записать();
		
		НЗ = РегистрыСведений.УСОERP_ПотребностьВРесурсах.СоздатьНаборЗаписей();
		НЗ.Отбор.СценарийПланирования.Установить(СценарийПланирования);
		НЗ.Прочитать(); 			
		НЗ.Загрузить(РезультатЗапроса[1].Выгрузить());
		НЗ.Записать();
		
		НЗ = РегистрыСведений.УСОERP_СвязиМеждуРаботами.СоздатьНаборЗаписей();
		НЗ.ДополнительныеСвойства.Вставить("НовыйВариант");
		НЗ.Отбор.СценарийПланирования.Установить(СценарийПланирования);
		НЗ.Прочитать(); 			
		НЗ.Загрузить(РезультатЗапроса[2].Выгрузить());
		НЗ.Записать(); 		
		
	КонецЕсли;
		
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Ответственный   = Пользователи.ТекущийПользователь();
	Организация     =  ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	ДатаВерсииПлана = ТекущаяДата();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура СформироватьСписокРегистровДляКонтроля()
	
	Массив = Новый Массив;
	
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	КонецЕсли;
	
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);
	
КонецПроцедуры

Процедура ОтменитьПризнакУтверждения() Экспорт
	РегистрыСведений.УСОERP_ПараметрыВыполненияРабот.ОтменитьПризнакУтверждения(Ссылка, Ложь);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("НаправлениеДеятельности");
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
